inha-fc/inhaino-esp32cam/CameraWebServer/app_httpd.cpp
static esp_err_t pll_handler(httpd_req_t *req) {
  if (!check_auth(req)) {
    return reject_auth(req);
  }
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  if (!check_auth(req)) {
    return reject_auth(req);
  }
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);  // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
    "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
    totalX, totalY, outputX, outputY, scale, binning  // codespell:ignore totaly
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning);  // codespell:ignore totaly
  if (res) {
    return httpd_resp_send_500(req);
  }

  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t index_handler(httpd_req_t *req) {
  if (!check_auth(req)) {
    return reject_auth(req);
  }
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) {
    if (s->id.PID == OV3660_PID) {
      return httpd_resp_send(req, (const char *)index_ov3660_html_gz, index_ov3660_html_gz_len);
    } else if (s->id.PID == OV5640_PID) {
      return httpd_resp_send(req, (const char *)index_ov5640_html_gz, index_ov5640_html_gz_len);
    } else {
      return httpd_resp_send(req, (const char *)index_ov2640_html_gz, index_ov2640_html_gz_len);
    }
  } else {
    log_e("Camera sensor not found");
    return httpd_resp_send_500(req);
  }
}

static bool tls_load_nvs(char **cert_out, char **key_out) {
  nvs_handle_t nvs;
  if (nvs_open(TLS_NVS_NS, NVS_READONLY, &nvs) != ESP_OK) return false;

  size_t cert_len = 0, key_len = 0;
  bool ok = nvs_get_str(nvs, "cert", NULL, &cert_len) == ESP_OK &&
            nvs_get_str(nvs, "key",  NULL, &key_len)  == ESP_OK;
  if (!ok) { nvs_close(nvs); return false; }

  *cert_out = (char *)malloc(cert_len);
  *key_out  = (char *)malloc(key_len);
  ok = *cert_out && *key_out &&
       nvs_get_str(nvs, "cert", *cert_out, &cert_len) == ESP_OK &&
       nvs_get_str(nvs, "key",  *key_out,  &key_len)  == ESP_OK;
  nvs_close(nvs);
  if (!ok) { free(*cert_out); free(*key_out); }
  return ok;
}

static bool tls_save_nvs(const char *cert, const char *key) {
  nvs_handle_t nvs;
  if (nvs_open(TLS_NVS_NS, NVS_READWRITE, &nvs) != ESP_OK) return false;
  bool ok = nvs_set_str(nvs, "cert", cert) == ESP_OK &&
            nvs_set_str(nvs, "key",  key)  == ESP_OK &&
            nvs_commit(nvs) == ESP_OK;
  nvs_close(nvs);
  return ok;
}

static esp_err_t recv_body(httpd_req_t *req, char **out, size_t max_len) {
  int len = req->content_len;
  if (len <= 0 || (size_t)len > max_len) {
    httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid body size");
    return ESP_FAIL;
  }
  char *buf = (char *)malloc(len + 1);
  if (!buf) { httpd_resp_send_500(req); return ESP_FAIL; }
  int got = httpd_req_recv(req, buf, len);
  if (got <= 0) { free(buf); httpd_resp_send_500(req); return ESP_FAIL; }
  buf[got] = '\0';
  *out = buf;
  return ESP_OK;
}

// POST /cert  — body: certificate PEM
// POST /cert/key — body: private key PEM
// Both together update NVS; device must restart to apply.
static esp_err_t cert_handler(httpd_req_t *req) {
  if (!check_auth(req)) return reject_auth(req);

  char *body = NULL;
  if (recv_body(req, &body, 4096) != ESP_OK) return ESP_FAIL;

  bool is_key = strstr(req->uri, "/key") != NULL;

  // Read the counterpart from NVS (or embedded default) to keep both in sync.
  char *nvs_cert = NULL, *nvs_key = NULL;
  bool had_nvs = tls_load_nvs(&nvs_cert, &nvs_key);
  const char *cert_pem = had_nvs ? nvs_cert : DEFAULT_CERT_PEM;
  const char *key_pem  = had_nvs ? nvs_key  : DEFAULT_KEY_PEM;

  bool ok = is_key ? tls_save_nvs(cert_pem, body)
                   : tls_save_nvs(body, key_pem);
  if (had_nvs) { free(nvs_cert); free(nvs_key); }
  free(body);

  httpd_resp_set_type(req, "application/json");
  if (!ok) return httpd_resp_send(req, "{\"result\":\"error\"}", -1);
  return httpd_resp_send(req,
    "{\"result\":\"ok\",\"note\":\"POST /restart to apply\"}", -1);
}

// POST /restart — graceful software reset
static esp_err_t restart_handler(httpd_req_t *req) {
  if (!check_auth(req)) return reject_auth(req);
  httpd_resp_set_type(req, "application/json");
  httpd_resp_send(req, "{\"result\":\"ok\",\"note\":\"restarting\"}", -1);
  vTaskDelay(500 / portTICK_PERIOD_MS);
  esp_restart();
  return ESP_OK;
}

void startCameraServer() {
  // Load TLS certificate from NVS; fall back to embedded default.
  char *nvs_cert = NULL, *nvs_key = NULL;
  bool has_nvs = tls_load_nvs(&nvs_cert, &nvs_key);
  const char *active_cert = has_nvs ? nvs_cert : DEFAULT_CERT_PEM;
  const char *active_key  = has_nvs ? nvs_key  : DEFAULT_KEY_PEM;

